{
    "0": {
        "num": 0,
        "image": "https://cdn.oneesports.gg/cdn-data/2022/08/TekkenBloodline_EasterEggs_Featured-1536x864.jpg",
        "title": "7 Tekken Bloodline Easter eggs only true Tekken gods can catch",
        "content":"Netflix’s Tekken Bloodline anime unravels the story of Jin Kazama and his mysterious martial arts lineage. Working off almost three decades of lore, the series producers snuck in a few secret references for diehard Tekken fans out there.\nTekken chief producer Katsuhiro Harada also mentioned that the series dives deeper into the relationship between Jin and his mom, Jun Kazama, that reveals new information about Jin’s fighting journey.\nAmidst the flashy moves and family feuds, here are 7 Tekken Bloodline Easter eggs that you probably didn’t know about."
    },


    "1": {
        "num": 1,
        "image": "https://www.dexerto.com/_next/image/?url=https%3A%2F%2Feditors.dexerto.com%2Fwp-content%2Fuploads%2F2022%2F09%2F01%2FG2-Hel-1.jpg&w=640&q=75",
        "title": "G2 sign all-women’s League of Legends roster: G2 Hel",
        "content": "As women’s esports continue to grow, more and more major organizations are looking to invest in the space. With multiple organizations picking up women’s-only teams to compete in Valorant’s Game Changers initiative, we’re seeing more involvement in women’s esports than ever before.\nAnd after the success of their G2 Gozen Valorant roster, G2 Esports are looking to League of Legends for their next foray into women’s esports. On September 1, the organization announced the signing of their first ever all-female League of Legends roster, known as G2 Hel.\nThe roster includes multiple graduates of SK Gaming’s Avarosa program, an initiative designed to give women and non-binary individuals a foothold into the world of competitive League of Legends."
    },
    "2": {
        "num": 2,
        "image": "https://www.dexerto.com/_next/image/?url=https%3A%2F%2Feditors.dexerto.com%2Fwp-content%2Fuploads%2F2022%2F08%2F31%2Ffaker-amber-razer-campaign.jpg&w=640&q=75",
        "title": "How Faker and Paladin Amber made dreams reality in esports & streaming",
        "content": "Being at the top of your game isn’t something that happens by chance, and that couldn’t ring more true than in the world of esports, gaming, and content. Be it a championship trophy, an insane performance, or a viral clip, Razer is helping players and creators win it their way.\nWe spoke with League of Legends icon Lee ‘Faker’ Sang-hyeok and content creator Amber ‘PaladinAmber’ Wadham to find out how they reached the pinnacle of their field, and how Razer helped them get there.\n-Faker\n*https://www.dexerto.com/_next/image/?url=https%3A%2F%2Feditors.dexerto.com%2Fwp-content%2Fuploads%2F2022%2F08%2F31%2FFaker-Razer-1024x576.jpg&w=1920&q=75\nWhen someone says esports, one of the first names you should think of is Faker. He’s the face of League of Legends, a celebrity beyond what anybody could have imagined, and a three-time world champion. The best bit? He doesn’t expect to call it quits any time soon.\n-Paladin Amber\n*https://www.dexerto.com/_next/image/?url=https%3A%2F%2Feditors.dexerto.com%2Fwp-content%2Fuploads%2F2022%2F08%2F31%2Fpaladinamber-razer-1024x576.jpg&w=1920&q=75\nPaladin Amber is one of Twitch’s best success stories, with the Australian flourishing into her own on the platform. She got her start knuckling down in Rainbow Six Siege, but diversified into more of a variety streamer."
    },


    "3": {
        "num": 3,
        "image": "https://www.dexerto.com/_next/image/?url=https%3A%2F%2Feditors.dexerto.com%2Fwp-content%2Fuploads%2F2020%2F10%2Fbjergsen-TSM-announcement-retire-head-coach.jpg&w=640&q=75",
        "title": "Bjergsen sets incredible new LCS record for most career kills",
        "content": "The mid-lane star is known for his eight-season long stint at TSM and is considered to be one of the best players in the entire league.\nNow, following his return to pro-play in 2022 competing under the Team Liquid banner — and after a year of leading his former team TSM as their head coach — the 26-year-old player has set the record as the LCS‘ all-time kill leader.\n*https://www.dexerto.com/_next/image/?url=https%3A%2F%2Feditors.dexerto.com%2Fwp-content%2Fuploads%2F2020%2F10%2Fbjergsen-tsm-1024x576.jpg&w=1920&q=75\nThe veteran mid-laner is well respected and considered to be one of the world’s best by LCS fans. Now, he’s made a historic achievement.\nAlongside his impressive six LCS titles under his name, he can lay claim to the title as one of the greatest players in the league’s history.\nFollowing the close best-of-five series against 100 Thieves, the Danish mid-laner has set a new kill record. According to stats, Bjergsen is now the all-time LCS kill leader with 2,274 total kills – taking the record from veteran ADC WildTurtle."
    },

    "4": {
        "num": 4,
        "image": "https://www.dexerto.com/_next/image/?url=https%3A%2F%2Feditors.dexerto.com%2Fwp-content%2Fuploads%2F2022%2F09%2F03%2Ftlou-part-1.jpg&w=640&q=75",
        "title": "Sony won’t replace damaged The Last of Us Part 1 Firefly Editions, fans claim",
        "content": "-Many buyers of the Firefly Edition of The Last of Us Part 1 are reporting the game was delivered to them massively damaged, and now Sony is apparently refusing to replace their copies.\nThere’s nothing worse than getting a damaged package in the mail, especially when the parcel is a limited edition game. For those who purchased the special Firefly Edition of The Last of Us Part 1, the launch day of the action-adventure remake quickly went from celebration to nightmare as many fans reported their copies were beaten up when delivered.\n-Fans lash out at Sony after The Last of Us Part 1 shipments damaged\nThe remake of the original The Last of Us was released on September 2, meaning orders of the base game and the limited Firefly Edition began delivering to buyers on the same day.\nSadly, tons of TLOU fans began noticing their Firefly Edition copes were extremely damaged during the packaging in the shipping process. One user shared pictures of their box, which was completely crushed on the top with packaging residue glued onto the side.\n“Terrible shipping, both mine and my brothers. Thanks Sony,” Reddit user joshuadhembree said.\n*https://user-images.githubusercontent.com/58645688/188309704-cdb0d827-756a-4d9b-8977-96b8df9f732d.png\nIn the comment section, multiple other Last of Us fans shared similar stories about their copies being damaged. One said, “This is exactly how mine was shipped and mine was crushed on all 4 sides, I am so mad right now!”\nAnother user on social media shared pictures of their damaged box of the game and said, “I am so upset right now. I paid $107.99 for The Last of Us Part 1 Firefly Edition and it came in damaged. I can’t even get a replacement. I can only get a refund even though I really wanted it.”\nMany fans that got their copies damaged in the mail have scrambled to try and get their copies replaced with undamaged boxes, but apparently, Sony has yet to offer replacing the game and has only offered refunds.\nWith copies of the Firefly Edition limited, many TLOU fans wanted the special edition of the game and not the cash back."
    },

    "5": {
        "num": 5,
        "image": "https://pbs.twimg.com/media/Fbkc2KfXEAArvKF.jpg",
        "title": "NAVI announce Road to Valorant academy project to find new players",
        "content": "NAVI have announced an overhaul of their Valorant division, starting with the departure of three players from their main team — Denis dinkz Tkachev, Mikhail Duno Fokin and Nikolai zeddy Lapko after an unsuccessful qualifying campaign for Champions.\nThe Ukrainian organization is retaining the services of Kirill Cloud Nehozhin and Artur 7ssk7 Kyurshin, who will be joined by the top prospects unearthed by the new academy program. NAVI are looking for players aged 16 to 19 who reside in Europe and are not under contract with any organization.\nUsing the example of our CS:GO academy, we are confident we can equip players with qualities necessary for the club, so that they can make the main team in the future, NAVI Head of Esports Amiran ami Rekhviashvili said in a statement.\nThe Academy will allow us to discover new talents in Eastern Europe and Ukraine. We at NAVI need to develop our own scene, which is what we are setting out to do in the near future."
    },

    
    "6": {
        "num": 6,
        "image": "",
        "title": "only says woof",
        "content": "woof woof woof."
    },
    "7": {
        "num": 7,
        "image": "",
        "title": "only says woof",
        "content": "woof woof woof."
    },
    "8": {
        "num": 8,
        "image": "",
        "title": "Homelander",
        "content": "Is your idiot brain getting fucked by stupid"
    }
}

